teacup/constant/cup/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/metal";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
	type            heSolidThermo;
	mixture         pureMixture;
	transport       constIso;
	thermo          hConst;
	equationOfState rhoConst;
	specie          specie;
	energy          sensibleEnthalpy;
}

mixture
{
	// Aluminium

	specie
	{
		molWeight       262;
	}
	equationOfState
	{
		rho             2300;
	}
	transport
	{
		kappa           1.5;
	}
	thermodynamics
	{
		Hf              0;
		Cp              1.07e-3;
	}
}

// ************************************************************************* //
