teacup/0/fluid/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/fluid";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 -1 -2 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
	left
	{
		type            fixedFluxPressure;
		value           $internalField;
	}
	right
	{
		type            fixedValue;
		value           uniform 0;
	}
	front
	{
		type            fixedFluxPressure;
		value           $internalField;
	}
	back
	{
		type            fixedFluxPressure;
		value           $internalField;
	}
	top
	{
		type            fixedFluxPressure;
		value           $internalField;
	}
	bottom
	{
		type            fixedFluxPressure;
		value           $internalField;
	}
	fluid_to_cup
	{
		type            fixedFluxPressure;
		value           $internalField;
	}
	fluid_to_tea
	{
		type            fixedFluxPressure;
		value           $internalField;
	}
}
