teacup/0/cup/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/heater";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 297.15;

boundaryField
{

    bottom
    {
		  type            zeroGradient;
    }
    cupbottom
    {
		  type            zeroGradient;
    }
    cup_to_tea
    {
      type            	compressible::turbulentTemperatureRadCoupledMixed;
      Tnbr            	T;
      kappaMethod     	solidThermo;
      kappa           	kappa;
      value           	$internalField;
    }
    cup_to_fluid
    {
      type            	compressible::turbulentTemperatureRadCoupledMixed;
      Tnbr            	T;
      kappaMethod     	solidThermo;
      kappa           	kappa;
      value           	$internalField;
    }

}
