teacup/0/fluid/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0.01";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.0034;

boundaryField
{
    left
    {
      type            turbulentIntensityKineticEnergyInlet;
      intensity       0.048;  //turbulence intensity
      value           uniform 0.0034;
    }
    right
    {
      type            fixedGradient;
      gradient        uniform 0;
    }
    front
    {
      type            kqRWallFunction; //standard wall function
      value           uniform 0.0034;
    }
    back
    {
      type            kqRWallFunction; //standard wall function
      value           uniform 0.0034;
    }
    top
    {
      type            kqRWallFunction; //standard wall function
      value           uniform 0.0034;
    }
    bottom
    {
      type            kqRWallFunction; //standard wall function
      value           uniform 0.0034;
    }
    fluid_to_cup
    {
      type            kqRWallFunction; //standard wall function
      value           uniform 0.0034;
    }
    fluid_to_tea
    {
      type            kqRWallFunction; //standard wall function
      value           uniform 0.0034;
    }

}
