teacup/0/tea/alphat
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0.01";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    tea_to_cup
    {
		  type            compressible::alphatJayatillekeWallFunction;
		  Prt             1.75; //Turbulent Prandtl number for water 0.85 for air 0.71
		  value           uniform 0;
    }
    tea_to_fluid
    {
		  type            compressible::alphatJayatillekeWallFunction;
		  Prt             1.75; //Turbulent Prandtl number
		  value           uniform 0;
    }
}

