teacup/0/tea/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0.01";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    tea_to_cup
    {
      type            nutkWallFunction; //wall function based on the magnitude of k
      value           uniform 1;
    }
    tea_to_fluid
    {
      type            nutkWallFunction; //wall function based on the magnitude of k
      value           uniform 1;
    }

}
