teacup/system/cup/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system/heater";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    h
    {
        solver           GAMG;
        smoother         symGaussSeidel;
        tolerance        1e-6;
        relTol           0.1;
    }

    hFinal
    {
        $h;
        relTol           0;
    }
}

PIMPLE
{
	nNonOrthogonalCorrectors 0;

	residualControl
	{
		h 			1e-6;
	}
}

relaxationFactors
{
	equations
	{
		h		0.5;
	}
}


// ************************************************************************* //
